ori $16, $0, 1              # 将0号寄存器与1的或运算结果存入16号寄存器
ori $17, $0, 3              # 将0号寄存器与3的或运算结果存入17号寄存器
ori $8, $0, 1               # 将0号寄存器与1的或运算结果存入8号寄存器
ori $12, $0,0xabab          # 将0号寄存器与0xabab的或运算结果存入12号寄存器
lui $13, 10                 # 将10左移16位存入13号寄存器
start:addu $4, $0,$16       # 将0号寄存器与16号寄存器的加法结果存入4号寄存器
addu $5, $0,$8              # 将0号寄存器与8号寄存器的加法结果存入5号寄存器
jal newadd                  # 跳转到newadd函数
addu $16, $0, $2            # 将0号寄存器与2号寄存器的加法结果存入16号寄存器
subu $17,$17,$8             # 将17号寄存器与8号寄存器的减法结果存入17号寄存器
beq $16, $17, start         # 如果16号寄存器与17号寄存器相等，跳转到start
ori $8, $0,4                # 将0号寄存器与4的或运算结果存入8号寄存器
addiu $24,$0,0x7fffffff     # 将0号寄存器与0x7fffffff的加法结果存入24号寄存器
addiu $9,$24,3              # 将24号寄存器与3的加法结果存入9号寄存器
addiu $10,$24,5             # 将24号寄存器与5的加法结果存入10号寄存器
addu $0,$0,$0               # 将0号寄存器与0号寄存器的加法结果存入0号寄存器
#addi $22,$24,6             # 将24号寄存器与6的加法结果存入22号寄存器
start2:sw $9, -4($8)        # 将9号寄存器的值存入8号寄存器-4的地址
sw $1, 0($8)                # 将1号寄存器的值存入8号寄存器的地址
lb $14, 3($8)               # 将8号寄存器+3的地址的字节存入14号寄存器
sb $12,7($8)                # 将12号寄存器的首字节存入8号寄存器+7的地址
lw $15,4($8)                # 将8号寄存器+4的地址的字存入15号寄存器
sb $4, -3($8)               # 将4号寄存器的首字节存入8号寄存器-3的地址
lb $18, -1($8)              # 将8号寄存器-1的地址的字节存入18号寄存器
addu $4,$0,$8               # 将0号寄存器与8号寄存器的加法结果存入4号寄存器
addu $5,$0,$9               # 将0号寄存器与9号寄存器的加法结果存入5号寄存器
jal newadd                  # 跳转到newadd函数
slt $25,$10,$8              # 将10号寄存器与8号寄存器的小于运算结果存入25号寄存器
beq $25, $0,end2            # 如果25号寄存器与0号寄存器相等，跳转到end2
slt $20,$12,$4              # 将12号寄存器与4号寄存器的小于运算结果存入20号寄存器
beq $20, $0, end1           # 如果20号寄存器与0号寄存器相等，跳转到end1
lui $12, 65535              # 将65535左移16位存入12号寄存器
end1:ori $0, $0,1           # 将0号寄存器与1的或运算结果存入0号寄存器
lui $19, 0xefef             # 将0xefef左移16位存入19号寄存器
addiu $3,$0,0xababcdcd      # 将0号寄存器与0xababcdcd的加法结果存入3号寄存器
start3:addiu $4, $3, 2      # 将3号寄存器与2的加法结果存入4号寄存器
addi $23, $3, 5             # 将3号寄存器与5的加法结果存入23号寄存器
jal newadd                  # 跳转到newadd函数
addu $8, $0, $2             # 将0号寄存器与2号寄存器的加法结果存入8号寄存器
addu $4, $0, $8             # 将0号寄存器与8号寄存器的加法结果存入4号寄存器
addu $5, $0, $9             # 将0号寄存器与9号寄存器的加法结果存入5号寄存器
jal newadd                  # 跳转到newadd函数
addu $9, $0, $2             # 将0号寄存器与2号寄存器的加法结果存入9号寄存器
addu $9, $8, $0             # 将8号寄存器与0号寄存器的加法结果存入9号寄存器
lui $10, 0x69               # 将0x69左移16位存入10号寄存器
beq $8, $9, start4          # 如果8号寄存器与9号寄存器相等，跳转到start4
beq $0, $0, start3          # 如果0号寄存器与0号寄存器相等，跳转到start3
start4:j end                # 跳转到end
newadd:addu $2, $4, $5      # 将4号寄存器与5号寄存器的加法结果存入2号寄存器
addi $0,$12,0x1234          # 将12号寄存器与0x1234的加法结果存入0号寄存器
jr $31                      # 跳转到31号寄存器
end2:addi $26,$0,0x5678     # 将0号寄存器与0x5678的加法结果存入26号寄存器
end:                        # 结束
